web_service/atividade1.1/test.xml

 <?xml version="1.0"?>
<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope/"
soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
<soap:Body xmlns:m="http://www.minhaempresa.com/consultaCliente">
  <m:consultaCliente>
    <m:cpf>42598727835</m:cpf>
  </m:consultaCliente>
</soap:Body>
</soap:Envelope>

 
<?xml version="1.0"?>
<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope/"
soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
<soap:Body xmlns:m="http://www.minhaempresa.com/consultaCliente">
  <m:consultaClienteResponse>
    <m:nome>James Paul McCartney</m:nome>
    <m:endereco>Rua Amaury de Medeiros, 128</m:endereco>
    <m:telefone>(81) 99988-7766</m:telefone>
  </m:consultaClienteResponse>
</soap:Body>
</soap:Envelope>